app/views/posts/index.html.erb

SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('老虎'))
---
                  <%= link_to '更多', post_path(post), class: "btn btn-success" %>
                   标签: <%= raw post.tag_list.map { |t| link_to t, tag_path(t) }.join('. ') %>