app/controllers/posts_controller.rb

  def index
    if params[:tag]
      @posts = Post.tagged_with(params[:tag]).order(created_at: :desc)
---
SELECT "posts".* FROM "posts" JOIN taggings posts_taggings_caa7a22  ON posts_taggings_caa7a22.taggable_id = posts.id AND posts_taggings_caa7a22.taggable_type = 'Post' AND posts_taggings_caa7a22.tag_id = 13  ORDER BY "posts"."created_at" DESC

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("content", "picture", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "冷静的它"], ["picture", "thumb-christopher-walken.jpg"], ["title", "冷静的它"], ["created_at", "2016-03-17 09:47:11.055534"], ["updated_at", "2016-03-17 09:47:11.055534"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "picture" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["picture", "___99999.png"], ["updated_at", "2016-03-13 20:01:00.349147"], ["id", 16]]